MikroElektronika/core_packages/PIC/XC8/def/PIC18F67J60/mcu.h
// Register: ECCP3DEL
#define ECCP3DEL ECCP3DEL
extern volatile unsigned char           ECCP3DEL            __at(0xF69);
#ifndef _LIB_BUILD
asm("ECCP3DEL equ 0F69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PDC                    :7;
        unsigned PRSEN                  :1;
    };
    struct {
        unsigned PDC0                   :1;
        unsigned PDC1                   :1;
        unsigned PDC2                   :1;
        unsigned PDC3                   :1;
        unsigned PDC4                   :1;
        unsigned PDC5                   :1;
        unsigned PDC6                   :1;
    };
    struct {
        unsigned P3DC0                  :1;
        unsigned P3DC1                  :1;
        unsigned P3DC2                  :1;
        unsigned P3DC3                  :1;
        unsigned P3DC4                  :1;
        unsigned P3DC5                  :1;
        unsigned P3DC6                  :1;
        unsigned P3RSEN                 :1;
    };
} ECCP3DELbits_t;
extern volatile ECCP3DELbits_t ECCP3DELbits __at(0xF69);
// bitfield macros
#define _ECCP3DEL_PDC_POSN                                  0x0
#define _ECCP3DEL_PDC_POSITION                              0x0
#define _ECCP3DEL_PDC_SIZE                                  0x7
#define _ECCP3DEL_PDC_LENGTH                                0x7
#define _ECCP3DEL_PDC_MASK                                  0x7F
#define _ECCP3DEL_PRSEN_POSN                                0x7
#define _ECCP3DEL_PRSEN_POSITION                            0x7
#define _ECCP3DEL_PRSEN_SIZE                                0x1
#define _ECCP3DEL_PRSEN_LENGTH                              0x1
#define _ECCP3DEL_PRSEN_MASK                                0x80
#define _ECCP3DEL_PDC0_POSN                                 0x0
#define _ECCP3DEL_PDC0_POSITION                             0x0
#define _ECCP3DEL_PDC0_SIZE                                 0x1
#define _ECCP3DEL_PDC0_LENGTH                               0x1
#define _ECCP3DEL_PDC0_MASK                                 0x1
#define _ECCP3DEL_PDC1_POSN                                 0x1
#define _ECCP3DEL_PDC1_POSITION                             0x1
#define _ECCP3DEL_PDC1_SIZE                                 0x1
#define _ECCP3DEL_PDC1_LENGTH                               0x1
#define _ECCP3DEL_PDC1_MASK                                 0x2
#define _ECCP3DEL_PDC2_POSN                                 0x2
#define _ECCP3DEL_PDC2_POSITION                             0x2
#define _ECCP3DEL_PDC2_SIZE                                 0x1
#define _ECCP3DEL_PDC2_LENGTH                               0x1
#define _ECCP3DEL_PDC2_MASK                                 0x4
#define _ECCP3DEL_PDC3_POSN                                 0x3
#define _ECCP3DEL_PDC3_POSITION                             0x3
#define _ECCP3DEL_PDC3_SIZE                                 0x1
#define _ECCP3DEL_PDC3_LENGTH                               0x1
#define _ECCP3DEL_PDC3_MASK                                 0x8
#define _ECCP3DEL_PDC4_POSN                                 0x4
#define _ECCP3DEL_PDC4_POSITION                             0x4
#define _ECCP3DEL_PDC4_SIZE                                 0x1
#define _ECCP3DEL_PDC4_LENGTH                               0x1
#define _ECCP3DEL_PDC4_MASK                                 0x10
#define _ECCP3DEL_PDC5_POSN                                 0x5
#define _ECCP3DEL_PDC5_POSITION                             0x5
#define _ECCP3DEL_PDC5_SIZE                                 0x1
#define _ECCP3DEL_PDC5_LENGTH                               0x1
#define _ECCP3DEL_PDC5_MASK                                 0x20
#define _ECCP3DEL_PDC6_POSN                                 0x6
#define _ECCP3DEL_PDC6_POSITION                             0x6
#define _ECCP3DEL_PDC6_SIZE                                 0x1
#define _ECCP3DEL_PDC6_LENGTH                               0x1
#define _ECCP3DEL_PDC6_MASK                                 0x40
#define _ECCP3DEL_P3DC0_POSN                                0x0
#define _ECCP3DEL_P3DC0_POSITION                            0x0
#define _ECCP3DEL_P3DC0_SIZE                                0x1
#define _ECCP3DEL_P3DC0_LENGTH                              0x1
#define _ECCP3DEL_P3DC0_MASK                                0x1
#define _ECCP3DEL_P3DC1_POSN                                0x1
#define _ECCP3DEL_P3DC1_POSITION                            0x1
#define _ECCP3DEL_P3DC1_SIZE                                0x1
#define _ECCP3DEL_P3DC1_LENGTH                              0x1
#define _ECCP3DEL_P3DC1_MASK                                0x2
#define _ECCP3DEL_P3DC2_POSN                                0x2
#define _ECCP3DEL_P3DC2_POSITION                            0x2
#define _ECCP3DEL_P3DC2_SIZE                                0x1
#define _ECCP3DEL_P3DC2_LENGTH                              0x1
#define _ECCP3DEL_P3DC2_MASK                                0x4
#define _ECCP3DEL_P3DC3_POSN                                0x3
#define _ECCP3DEL_P3DC3_POSITION                            0x3
#define _ECCP3DEL_P3DC3_SIZE                                0x1
#define _ECCP3DEL_P3DC3_LENGTH                              0x1
#define _ECCP3DEL_P3DC3_MASK                                0x8
#define _ECCP3DEL_P3DC4_POSN                                0x4
#define _ECCP3DEL_P3DC4_POSITION                            0x4
#define _ECCP3DEL_P3DC4_SIZE                                0x1
#define _ECCP3DEL_P3DC4_LENGTH                              0x1
#define _ECCP3DEL_P3DC4_MASK                                0x10
#define _ECCP3DEL_P3DC5_POSN                                0x5
#define _ECCP3DEL_P3DC5_POSITION                            0x5
#define _ECCP3DEL_P3DC5_SIZE                                0x1
#define _ECCP3DEL_P3DC5_LENGTH                              0x1
#define _ECCP3DEL_P3DC5_MASK                                0x20
#define _ECCP3DEL_P3DC6_POSN                                0x6
#define _ECCP3DEL_P3DC6_POSITION                            0x6
#define _ECCP3DEL_P3DC6_SIZE                                0x1
#define _ECCP3DEL_P3DC6_LENGTH                              0x1
#define _ECCP3DEL_P3DC6_MASK                                0x40
#define _ECCP3DEL_P3RSEN_POSN                               0x7
#define _ECCP3DEL_P3RSEN_POSITION                           0x7
#define _ECCP3DEL_P3RSEN_SIZE                               0x1
#define _ECCP3DEL_P3RSEN_LENGTH                             0x1
#define _ECCP3DEL_P3RSEN_MASK                               0x80

// Register: ECCP3AS
#define ECCP3AS ECCP3AS
extern volatile unsigned char           ECCP3AS             __at(0xF6A);
#ifndef _LIB_BUILD
asm("ECCP3AS equ 0F6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSSBD                  :2;
        unsigned PSSAC                  :2;
        unsigned ECCPAS                 :3;
        unsigned ECCPASE                :1;
    };
    struct {
        unsigned PSSBD0                 :1;
        unsigned PSSBD1                 :1;
        unsigned PSSAC0                 :1;
        unsigned PSSAC1                 :1;
        unsigned ECCPAS0                :1;
        unsigned ECCPAS1                :1;
        unsigned ECCPAS2                :1;
    };
    struct {
        unsigned PSS3BD0                :1;
        unsigned PSS3BD1                :1;
        unsigned PSS3AC0                :1;
        unsigned PSS3AC1                :1;
        unsigned ECCP3AS0               :1;
        unsigned ECCP3AS1               :1;
        unsigned ECCP3AS2               :1;
        unsigned ECCP3ASE               :1;
    };
} ECCP3ASbits_t;
extern volatile ECCP3ASbits_t ECCP3ASbits __at(0xF6A);
// bitfield macros
#define _ECCP3AS_PSSBD_POSN                                 0x0
#define _ECCP3AS_PSSBD_POSITION                             0x0
#define _ECCP3AS_PSSBD_SIZE                                 0x2
#define _ECCP3AS_PSSBD_LENGTH                               0x2
#define _ECCP3AS_PSSBD_MASK                                 0x3
#define _ECCP3AS_PSSAC_POSN                                 0x2
#define _ECCP3AS_PSSAC_POSITION                             0x2
#define _ECCP3AS_PSSAC_SIZE                                 0x2
#define _ECCP3AS_PSSAC_LENGTH                               0x2
#define _ECCP3AS_PSSAC_MASK                                 0xC
#define _ECCP3AS_ECCPAS_POSN                                0x4
#define _ECCP3AS_ECCPAS_POSITION                            0x4
#define _ECCP3AS_ECCPAS_SIZE                                0x3
#define _ECCP3AS_ECCPAS_LENGTH                              0x3
#define _ECCP3AS_ECCPAS_MASK                                0x70
#define _ECCP3AS_ECCPASE_POSN                               0x7
#define _ECCP3AS_ECCPASE_POSITION                           0x7
#define _ECCP3AS_ECCPASE_SIZE                               0x1
#define _ECCP3AS_ECCPASE_LENGTH                             0x1
#define _ECCP3AS_ECCPASE_MASK                               0x80
#define _ECCP3AS_PSSBD0_POSN                                0x0
#define _ECCP3AS_PSSBD0_POSITION                            0x0
#define _ECCP3AS_PSSBD0_SIZE                                0x1
#define _ECCP3AS_PSSBD0_LENGTH                              0x1
#define _ECCP3AS_PSSBD0_MASK                                0x1
#define _ECCP3AS_PSSBD1_POSN                                0x1
#define _ECCP3AS_PSSBD1_POSITION                            0x1
#define _ECCP3AS_PSSBD1_SIZE                                0x1
#define _ECCP3AS_PSSBD1_LENGTH                              0x1
#define _ECCP3AS_PSSBD1_MASK                                0x2
#define _ECCP3AS_PSSAC0_POSN                                0x2
#define _ECCP3AS_PSSAC0_POSITION                            0x2
#define _ECCP3AS_PSSAC0_SIZE                                0x1
#define _ECCP3AS_PSSAC0_LENGTH                              0x1
#define _ECCP3AS_PSSAC0_MASK                                0x4
#define _ECCP3AS_PSSAC1_POSN                                0x3
#define _ECCP3AS_PSSAC1_POSITION                            0x3
#define _ECCP3AS_PSSAC1_SIZE                                0x1
#define _ECCP3AS_PSSAC1_LENGTH                              0x1
#define _ECCP3AS_PSSAC1_MASK                                0x8
#define _ECCP3AS_ECCPAS0_POSN                               0x4
#define _ECCP3AS_ECCPAS0_POSITION                           0x4
#define _ECCP3AS_ECCPAS0_SIZE                               0x1
#define _ECCP3AS_ECCPAS0_LENGTH                             0x1
#define _ECCP3AS_ECCPAS0_MASK                               0x10
#define _ECCP3AS_ECCPAS1_POSN                               0x5
#define _ECCP3AS_ECCPAS1_POSITION                           0x5
#define _ECCP3AS_ECCPAS1_SIZE                               0x1
#define _ECCP3AS_ECCPAS1_LENGTH                             0x1
#define _ECCP3AS_ECCPAS1_MASK                               0x20
#define _ECCP3AS_ECCPAS2_POSN                               0x6
#define _ECCP3AS_ECCPAS2_POSITION                           0x6
#define _ECCP3AS_ECCPAS2_SIZE                               0x1
#define _ECCP3AS_ECCPAS2_LENGTH                             0x1
#define _ECCP3AS_ECCPAS2_MASK                               0x40
#define _ECCP3AS_PSS3BD0_POSN                               0x0
#define _ECCP3AS_PSS3BD0_POSITION                           0x0
#define _ECCP3AS_PSS3BD0_SIZE                               0x1
#define _ECCP3AS_PSS3BD0_LENGTH                             0x1
#define _ECCP3AS_PSS3BD0_MASK                               0x1
#define _ECCP3AS_PSS3BD1_POSN                               0x1
#define _ECCP3AS_PSS3BD1_POSITION                           0x1
#define _ECCP3AS_PSS3BD1_SIZE                               0x1
#define _ECCP3AS_PSS3BD1_LENGTH                             0x1
#define _ECCP3AS_PSS3BD1_MASK                               0x2
#define _ECCP3AS_PSS3AC0_POSN                               0x2
#define _ECCP3AS_PSS3AC0_POSITION                           0x2
#define _ECCP3AS_PSS3AC0_SIZE                               0x1
#define _ECCP3AS_PSS3AC0_LENGTH                             0x1
#define _ECCP3AS_PSS3AC0_MASK                               0x4
#define _ECCP3AS_PSS3AC1_POSN                               0x3
#define _ECCP3AS_PSS3AC1_POSITION                           0x3
#define _ECCP3AS_PSS3AC1_SIZE                               0x1
#define _ECCP3AS_PSS3AC1_LENGTH                             0x1
#define _ECCP3AS_PSS3AC1_MASK                               0x8
#define _ECCP3AS_ECCP3AS0_POSN                              0x4
#define _ECCP3AS_ECCP3AS0_POSITION                          0x4
#define _ECCP3AS_ECCP3AS0_SIZE                              0x1
#define _ECCP3AS_ECCP3AS0_LENGTH                            0x1
#define _ECCP3AS_ECCP3AS0_MASK                              0x10
#define _ECCP3AS_ECCP3AS1_POSN                              0x5
#define _ECCP3AS_ECCP3AS1_POSITION                          0x5
#define _ECCP3AS_ECCP3AS1_SIZE                              0x1
#define _ECCP3AS_ECCP3AS1_LENGTH                            0x1
#define _ECCP3AS_ECCP3AS1_MASK                              0x20
#define _ECCP3AS_ECCP3AS2_POSN                              0x6
#define _ECCP3AS_ECCP3AS2_POSITION                          0x6
#define _ECCP3AS_ECCP3AS2_SIZE                              0x1
#define _ECCP3AS_ECCP3AS2_LENGTH                            0x1
#define _ECCP3AS_ECCP3AS2_MASK                              0x40
#define _ECCP3AS_ECCP3ASE_POSN                              0x7
#define _ECCP3AS_ECCP3ASE_POSITION                          0x7
#define _ECCP3AS_ECCP3ASE_SIZE                              0x1
#define _ECCP3AS_ECCP3ASE_LENGTH                            0x1
#define _ECCP3AS_ECCP3ASE_MASK                              0x80

